             DCL        VAR(&TYPCA£) TYPE(*INT)  LEN(4)
             DCL        VAR(&APPHN£) TYPE(*CHAR) LEN(8)
             DCL        VAR(&PNLNA£) TYPE(*CHAR) LEN(10)
             DCL        VAR(&FNCKE£) TYPE(*INT)  LEN(4) 
