             CALL       PGM(QUIPUTV) PARM(+
                          (&APPHND)            /* Application handle              */ +
                          (&VARRCD_P *BYVAL)   /* Variable buffer                 */ +
                          (&VARLEN)            /* Variable buffer length          */ +
                          (&VARNAM)            /* Variable record name            */ +
                          (&ERRCOD)            /* Error code                      */ )
